app/controllers/games_controller.rb

  def create
  	if params[:game]
  		if params[:game][:your_score].to_i > params[:game][:opponent_score].to_i
  			winning_user = current_user
  			losing_user = User.find_by_email(params[:game][:opponent])
  			params[:game][:winning_user_id] = winning_user.id
  			params[:game][:losing_user_id] = losing_user.id
  			params[:game][:winning_user_score] = params[:game][:your_score].to_i
  			params[:game][:losing_user_score] = params[:game][:opponent_score].to_i
  		else
  			winning_user = User.find_by_email(params[:game][:opponent])
  			losing_user = current_user
  			params[:game][:losing_user_id] = losing_user.id
  			params[:game][:winning_user_id] = winning_user.id
  			params[:game][:losing_user_score] = params[:game][:your_score].to_i
  			params[:game][:winning_user_score] = params[:game][:opponent_score].to_i
  		end
  		@game = Game.new(game_params)
  		@game.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'opponent@gmail.com' LIMIT 1
INSERT INTO `games` (`losing_user_id`, `winning_user_id`, `losing_user_score`, `winning_user_score`, `date_played`, `created_at`, `updated_at`) VALUES (2, 1, 33, 44, '2015-04-11 00:00:00', '2016-01-30 20:06:31', '2016-01-30 20:06:31')